tiborsimon/embedded-tdd-headers/pic/pic16/pic16f676_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F676_H_
#define _PIC16F676_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define RA5                           18
#define PORTC                         19
#define RC0                           20
#define RC1                           21
#define RC2                           22
#define RC3                           23
#define RC4                           24
#define RC5                           25
#define PCLATH                        26
#define INTCON                        27
#define RAIF                          28
#define INTF                          29
#define T0IF                          30
#define TMR0IF                        31
#define RAIE                          32
#define INTE                          33
#define T0IE                          34
#define TMR0IE                        35
#define PEIE                          36
#define GIE                           37
#define PIR1                          38
#define T1IF                          39
#define TMR1IF                        40
#define CMIF                          41
#define ADIF                          42
#define EEIF                          43
#define T1CON                         44
#define TMR1ON                        45
#define TMR1CS                        46
#define nT1SYNC                       47
#define T1OSCEN                       48
#define T1CKPS0                       49
#define T1CKPS                        50
#define T1CKPS1                       51
#define TMR1GE                        52
#define CMCON                         53
#define CM                            54
#define CM0                           55
#define CM1                           56
#define CM2                           57
#define CIS                           58
#define CINV                          59
#define COUT                          60
#define ADCON0                        61
#define ADON                          62
#define nDONE                         63
#define GO_nDONE                      64
#define GO_DONE                       65
#define GO                            66
#define CHS                           67
#define CHS0                          68
#define CHS1                          69
#define CHS2                          70
#define VCFG                          71
#define ADFM                          72
#define OPTION_REG                    73
#define PS                            74
#define PS0                           75
#define PS1                           76
#define PS2                           77
#define PSA                           78
#define T0SE                          79
#define T0CS                          80
#define INTEDG                        81
#define nGPPU                         82
#define nRAPU                         83
#define TRISA                         84
#define TRISA0                        85
#define TRISA1                        86
#define TRISA2                        87
#define TRISA3                        88
#define TRISA4                        89
#define TRISA5                        90
#define TRISC                         91
#define TRISC0                        92
#define TRISC1                        93
#define TRISC2                        94
#define TRISC3                        95
#define TRISC4                        96
#define TRISC5                        97
#define PIE1                          98
#define T1IE                          99
#define TMR1IE                        100
#define CMIE                          101
#define ADIE                          102
#define EEIE                          103
#define PCON                          104
#define nBOR                          105
#define nBOD                          106
#define nPOR                          107
#define OSCCAL                        108
#define CAL0                          109
#define CAL                           110
#define CAL1                          111
#define CAL2                          112
#define CAL3                          113
#define CAL4                          114
#define CAL5                          115
#define ANSEL                         116
#define ANS0                          117
#define ANS1                          118
#define ANS2                          119
#define ANS3                          120
#define ANS4                          121
#define ANS5                          122
#define ANS6                          123
#define ANS7                          124
#define WPUA                          125
#define WPUA0                         126
#define WPUA1                         127
#define WPUA2                         128
#define WPUA4                         129
#define WPUA5                         130
#define IOCA                          131
#define IOCA0                         132
#define IOCA1                         133
#define IOCA2                         134
#define IOCA3                         135
#define IOCA4                         136
#define IOCA5                         137
#define VRCON                         138
#define VR0                           139
#define VR                            140
#define VR1                           141
#define VR2                           142
#define VR3                           143
#define VRR                           144
#define VREN                          145
#define EEDAT                         146
#define EECON1                        147
#define RD                            148
#define WR                            149
#define WREN                          150
#define WRERR                         151
#define ADCON1                        152
#define ADCS                          153
#define ADCS0                         154
#define ADCS1                         155
#define ADCS2                         156

#endif // _PIC16F676_H_
